Repository: Mohamed-Kaizen/ethiopian-identity-provider
Catalog: local/*/LC_MESSAGES/django.po
Languages: am

source: English
am: እንግሊዝኛ

source: Arabic
am: አረብኛ

source: Amharic
am: አማርኛ

source: Dev
am: ልማት

source: Production
am: ምርት

source: Ethiopian Identity Provider API
am: የኢትዮጵያ ማንነት አቅራቢ ኤ.ፒ.አይ.

source: v1
am: ሥሪት 1

source: Ethiopian Identity Provider platform
am: የኢትዮጵያ መታወቂያ አቅራቢ መድረክ

source: Ethiopia Identity Administrator Platform
am: የኢትዮ Administያ ማንነት መታወቂያ አስተዳዳሪ

source: Ethiopian Identity Administrator
am: የኢትዮጵያ መታወቂያ አስተዳዳሪ

source: Delete
am: ሰርዝ

source: Empty apps
am: ባዶ መተግበሪያዎች

source: Are you sure to delete
am: እርግጠኛ ነዎት መሰረዝ ይፈልጋሉ

source: app?
am: መተግበሪያ?

source: Cancel
am: ይቅር

source: Detail
am: በዝርዝር

source: detail
am: በዝርዝር

source: client id
am: የደንበኛ መታወቂያ

source: client secret
am: የደንበኛ ምስጢር

source: client type
am: የደንበኛ ዓይነት

source: authorization grant type
am: ፈቃድ መስጫ ዓይነት

source: redirect uris
am: ዩ.አር.ኤል. ቀይር

source: Go Back
am: ተመለስ

source: Edit
am: ያርትዑ

source: Update
am: አዘምን

source: confidential
am: ሚስጥራዊ

source: public
am: ህዝባዊ

source: authorization code
am: ፈቃድ መስጫ ኮድ

source: implicit
am: ግልጽ ነው

source: resource owner password-based
am: በንብረት ባለቤት በይለፍ ቃል ላይ የተመሠረተ

source: client credentials
am: የደንበኛ ማስረጃዎች

source: Save
am: አስቀምጥ

source: Application List
am: የማመልከቻ ዝርዝር

source: Your Apps
am: የእርስዎ መተግበሪያዎች

source: new app
am: አዲስ መተግበሪያ

source: Register Application
am: ማመልከቻን ይመዝገቡ

source: Register new application
am: አዲስ መተግበሪያ ይመዝገቡ

source: Authorize application
am: ትግበራ ፍቀድ

source: Authorize
am: ፈቀዳ

source: profile
am: መገለጫ

source: by
am: በ

source: wants to access your
am: የእርስዎን ለመድረስ ይፈልጋል

source: account
am: መለያ

source: Personal user data
am: የግል የተጠቃሚ ውሂብ

source: Email addresses (read-only)
am: የኢሜል አድራሻዎች (ተነባቢ ብቻ)

source: Profile (read-only)
am: መገለጫ (ተነባቢ ብቻ)

source: Accepted Business (read-only)
am: ተቀባይነት ያለው ንግድ (ተነባቢ ብቻ)

source: Requested Business (read-only)
am: የተጠየቀ ንግድ (ተነባቢ ብቻ)

source: Create business request
am: የንግድ ጥያቄን ይፍጠሩ

source: Create renew request
am: የእድሳት ጥያቄ ይፍጠሩ

source: Error
am: ስህተት

source: Revoke token
am: ምልክትን ይሻሩ

source: throw away
am: ወደዚያ ጣል

source: Are you sure you want to delete this token?
am: እርግጠኛ ነዎት ይህንን ማስመሰያ መሰረዝ ይፈልጋሉ?

source: Authorized apps
am: የተፈቀደላቸው መተግበሪያዎች

source: Tokens
am: ማስመሰያዎች

source: Empty authorized apps
am: ባዶ ፈቃድ ያላቸው መተግበሪያዎች

source: Sign In
am: ስግን እን

source: sign in
am: ስግን እን

source: username
am: የተጠቃሚ ስም

source: Submit
am: ያስገቡ

source: Sign Out
am: ዛግተ ውጣ

source: Personal info
am: የግል መረጃ

source: Permissions
am: ፈቃዶች

source: Important dates
am: አስፈላጊ ቀናት

source: Mark selected business request as Accepted
am: የተመረጠውን የንግድ ጥያቄ እንደተቀበለ ምልክት ያድርጉበት

source: Mark selected business request as Deny
am: የተመረጠውን የንግድ ጥያቄ እንደ Deny ምልክት ያድርጉበት

source: Ethiopian Identity Administrator site admin
am: የኢትዮጵያ ማንነት መግለጫ አስተዳዳሪ

source: Ethiopian Identity Administrator Dashboard
am: የኢትዮጵያ መታወቂያ አስተዳዳሪ ዳሽቦርድ

source: Welcome to Ethiopian Identity Administrator
am: ወደኢትዮጽያ ማንነት አስተዳዳሪዎች እንኳን በደህና መጡ

source: Users
am: ተጠቃሚዎች

source: Requested
am: ተጠይቋል

source: Accepted
am: ተቀባይነት አግኝቷል

source: Deny
am: ከልክል

source: Sole Proprietorship
am: የግል ተቋም

source: Private Limited Company
am: የግል ኃላፊነቱ የተወሰነ ኩባንያ

source: unique id
am: ልዩ መታወቂያ

source: personal identity number
am: የግል መለያ ቁጥር

source: email address
am: የ ኢሜል አድራሻ

source: full name
am: ሙሉ ስም

source: picture
am: ስዕል

source: phone number
am: ስልክ ቁጥር

source: date of birth
am: የትውልድ ቀን

source: born
am: ተወለደ

source: nationality
am: ዜግነት

source: expired at
am: ጊዜው አልፎበታል በ

source: profiles
am: መገለጫዎች

source: Is Expired ?
am: ጊዜው አብቅቷል?

source: Expired in
am: ጊዜው አል inል

source: user
am: ተጠቃሚ

source: country
am: ሀገር

source: city
am: ከተማ

source: street
am: መንገድ

source: house number
am: የቤት ቁጥር

source: address
am: አድራሻ

source: addresses
am: አድራሻዎች

source: fingerprint
am: የጣት አሻራ

source: fingerprints
am: የጣት አሻራዎች

source: status
am: ሁኔታ

source: created at
am: የተፈጠረው በ

source: renew
am: ማደስ

source: renews
am: ያድሳል

source: name
am: ስም

source: description
am: መግለጫ

source: sub city
am: ክፍለ ከተማ

source: type
am: ዓይነት

source: requested by
am: ተጠይቋል በ

source: owners
am: ባለቤቶች

source: is active
am: ገባሪ ነው

source: created_at
am: ተፈጠረ

source: business
am: ንግድ

source: businesses
am: ንግዶች

source: This name cannot be registered.Please choose a different name.
am: ይህ ስም መመዝገብ አይችልም። እባክዎ የተለየ ስም ይምረጡ።

source: This email address cannot be registered. Please supply a different email address.
am: ይህ የኢሜይል አድራሻ መመዝገብ አይችልም። እባክዎ የተለየ የኢሜል አድራሻ ያቅርቡ

source: invalid
am: አያገለግልም

source: Your account has not been expired yet
am: መለያህ ገና አልጨረሰም

source: You have already send renew request. Please wait till it been accepted.
am: የእድሳት ጥያቄ ቀድሞውኑ ልከዋል። እስኪ ተቀባይነት እስኪያገኝ ድረስ ይጠብቁ።

source: You send renew request successfully
am: የእድሳት ጥያቄ በተሳካ ሁኔታ ይልካሉ

source: The name: {name} has been took. Try another name
am: ስም: {name} ተወስ .ል። ሌላ ስም ይሞክሩ

source: groups
am: ቡድኖች

source: Password
am: የይለፍ ቃል

source: Password confirmation
am: የይለፍ ቃል ማረጋገጫ

source: superuser status
am: ሱusርቫይዘር ሁኔታ

source: staff status
am: የሰራተኞች ሁኔታ

source: Designates that this user has all permissions without explicitly assigning them.
am: በግልጽ በግልጽ ካልተመደበው ይህ ተጠቃሚ ሁሉንም ፈቃዶች እንደያዘ ያሳያል።

source: Designates whether the user can log into this admin site.
am: ተጠቃሚው ወደዚህ የአስተዳዳሪ ጣቢያ ለመግባት መቻል ወይም አለመቻሉን ያሳያል።

source: Enter the same password as before, for verification.
am: ለማረጋገጫ እንደበፊቱ ተመሳሳይ የይለፍ ቃል ያስገቡ ፡፡

source: Required. 150 characters or fewer. Letters, digits and @/./+/-/_ only.
am: ያስፈልጋል 150 ቁምፊዎች ወይም ከዚያ ያነሱ። ፊደሎች ፣ ቁጥሮች እና @ /. / + / - / _ _ ብቻ።

source: Your password can’t be too similar to your other personal information.
am: የይለፍ ቃልዎ ከሌላ የግል መረጃዎ ጋር ተመሳሳይ ሊሆን አይችልም።

source: Your password must contain at least 8 characters.
am: የይለፍ ቃልዎ ቢያንስ 8 ቁምፊዎች መያዝ አለበት።

source: Your password can’t be a commonly used password.
am: የይለፍ ቃልዎ በተለምዶ የሚያገለግል የይለፍ ቃል ሊሆን አይችልም።

source: Your password can’t be entirely numeric.
am: የይለፍ ቃልዎ ሙሉ በሙሉ ቁጥራዊ ሊሆን አይችልም።

source: First, enter a username and password. Then, you’ll be able to edit more user options.
am: በመጀመሪያ የተጠቃሚ ስም እና የይለፍ ቃል ያስገቡ ፡፡ ከዚያ ተጨማሪ የተጠቃሚ አማራጮችን ማርትዕ ይችላሉ።

source: last login
am: የመጨረሻ ግባ

source: active
am: ንቁ

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
am: ይህ ተጠቃሚ እንደ ገባሪ ሆኖ መታየት እንዳለበት ይሾማል። መለያዎችን ከመሰረዝ ይልቅ ይህንን አይምረጡ።

source: user permissions
am: የተጠቃሚ ፈቃዶች

source: date joined
am: የተቀላቀለበት ቀን

source: Save and add another
am: ያስቀምጡ እና ሌላ ያክሉ

source: Save and continue editing
am: ያስቀምጡ እና ማርትዕዎን ይቀጥሉ

source: Recent actions
am: የቅርብ ጊዜ እርምጃዎች

source: My actions
am: የእኔ እርምጃዎች

source: Hold down “Control”, or “Command” on a Mac, to select more than one.
am: ከአንድ በላይ በመምረጥ መቆጣጠሪያን ወይም ትዕዛዙን ያዝ ያድርጉ።
